１月20日
■ EC CUBE
EC CUBEでJavascriptで顧客のクレジット情報などの情報をjsでサービス会社のサーバーに情報を投げて、専用トークンを取得する。
アクセスURLを変更に伴って、アクセスパスを変更する業務

■ OpenStreetMapで動いてしまう画像を静止画像にする。
OpenStreetMap + Leafletを使用しているがうまくいかない。

■ Toggl と backlogの設定
別メモ参照

1月21日
■ gitclone
backlogからgit cloneを行う。https通信で行う。
再pushの際にremote先変更後エラーが発生。ググって解決

■ OpenStreetMap + Leaflet
実際のローカル環境で実装。スタンダートな物は実装する事ができた。

■ EC CUBE
トークン先変更部分は見つける事はできたが、どういう仕組みで動いているのかわからない。
特にcontrollerの部分がどこでクラスが処理されているのかわからない。

1月22日
■ FTP
FTPソフトFileZillaの設定。
FTPの仕組みや反映方法を学習。
leafletのJavascpirtの部分を追加。

1月26日
■ 正規表現
正規表現を利用することで、文字列の検索や置換を行うことができる。
正規表現のマッチを確認できるブラウザ。http://okumocchi.jp/php/re.php

1月27日
■ ベーシック認証
サイトを更新するにあたって、ベーシック認証が必要との話を聞いていたので検索。
前からよくわからなかった.htaccessファイルを使う事がわかった。
ローカルで試したがうまくいかなかった。

■ エディタの使い方
コード検索のやり方がわかり、メソッドや変数がどこにあって、どうやって作用しているか見えてきた。






